//메타마스크: 이더리움을 이용하는 댑에 크롬 브라우저로 쉽게 접근 할 수 있는 익스텐션, 이더리움 WEB3 API가 들어가 있으므로 모든 웹사이트의 자바스크립트 컨택스트와 상호작용 가능

//#Web3.js
//- 이더리움 네트워크와 상호작용할 수 있는 다양한 메서드를 제공하는 자바스크립트 라이브러리이다.

//#ethers.js
//- Web3.js처럼 이더리움 네트워크를 조회하고 조작할 수 있는 인터페이스를 제공하는 라이브러리

//#Web3.js Modules
//1.Web3.eth
//- 이더리움 네트워크와 상호작용 모듈
//- 가장 많이 쓰임

//2.Web3.*.net
//- 네트워크 프로퍼티와 관련한 모듈

//3.Web3.bzz
//- Swarm 네트워크를 위한 모듈

//4.Web3.shh
//- whisper 프로토콜을 위한 모듈

//5.Web3.utils
//- 이더리움 댑과 관련한 유틸리티 함수 모음
//- 가장 많이 쓰임

//#Ethers.js Module
//1.Ethers.Provider
//- 이더리움 블록체인 커넥션을 위한 모듈로서 쿼리와 서명된 거래를 보내는 용도로 사용.

//2. Ethers.Contract
//- 스마트 컨트랙트 배포와 연동을 위한 모듈.
//- 스마트 컨트랙트 이벤트를 리슨하는 함수도 있고 스마트 컨트랙트의 정보나 특정 함수를 호출하는데 사용.

//3. Ethers.Wallet
//- 기존 이더리움 어드레스와 연결하는 기능을 제공하고 새로운 지갑을 생성하거나 트랜잭션을 서명하는 용도로 사용.

//Web3.js와 Ethers.js는 아주 큰 차이는 없으나 Web3.js가 가장 오래되었고 대표적으로 사용됨.

